NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG21/EFR32MG21B010F768IM32.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PRS_NS</name>
      <version>0</version>
      <description>PRS_NS Registers</description>
      <baseAddress>0x50038000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IP version ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNC_SWPULSE</name>
          <description>No Description</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>CH0PULSE</name>
              <description>Channel pulse</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1PULSE</name>
              <description>Channel pulse</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2PULSE</name>
              <description>Channel pulse</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH3PULSE</name>
              <description>Channel pulse</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH4PULSE</name>
              <description>Channel pulse</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH5PULSE</name>
              <description>Channel pulse</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH6PULSE</name>
              <description>Channel pulse</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH7PULSE</name>
              <description>Channel pulse</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH8PULSE</name>
              <description>Channel pulse</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH9PULSE</name>
              <description>Channel pulse</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH10PULSE</name>
              <description>Channel pulse</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH11PULSE</name>
              <description>Channel pulse</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNC_SWLEVEL</name>
          <description>No Description</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>CH0LEVEL</name>
              <description>Channel Level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1LEVEL</name>
              <description>Channel Level</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2LEVEL</name>
              <description>Channel Level</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3LEVEL</name>
              <description>Channel Level</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4LEVEL</name>
              <description>Channel Level</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5LEVEL</name>
              <description>Channel Level</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6LEVEL</name>
              <description>Channel Level</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7LEVEL</name>
              <description>Channel Level</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH8LEVEL</name>
              <description>Channel Level</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH9LEVEL</name>
              <description>Channel Level</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH10LEVEL</name>
              <description>Channel Level</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH11LEVEL</name>
              <description>Channel Level</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNC_PEEK</name>
          <description>No Description</description>
          <addressOffset>0x010</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>CH0VAL</name>
              <description>Channel 0 Current Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1VAL</name>
              <description>Channel 1 Current Value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2VAL</name>
              <description>Channel 2 Current Value</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3VAL</name>
              <description>Channel 3 Current Value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4VAL</name>
              <description>Channel 4 Current Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5VAL</name>
              <description>Channel 5 Current Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6VAL</name>
              <description>Channel 6 Current Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7VAL</name>
              <description>Channel 7 Current Value</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH8VAL</name>
              <description>Channel 8 Current Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH9VAL</name>
              <description>Channel 9 Current Value</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH10VAL</name>
              <description>Channel 10 Current Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH11VAL</name>
              <description>Channel 11 Current Value</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_PEEK</name>
          <description>No Description</description>
          <addressOffset>0x014</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>CH0VAL</name>
              <description>Channel 0 Current Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1VAL</name>
              <description>Channel 1 Current Value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2VAL</name>
              <description>Channel 2 Current Value</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3VAL</name>
              <description>Channel 3 Current Value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNC_CH0_CTRL</name>
          <description>No Description</description>
          <addressOffset>0x018</addressOffset>
          <access>read-write</access>
          <resetValue>0x000C0000</resetValue>
          <resetMask>0x000F7F07</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FNSEL</name>
              <description>Function Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGICAL_ZERO</name>
                  <description>Logical 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NOR_B</name>
                  <description>A NOR B</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_AND_B</name>
                  <description>(!A) AND B</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A</name>
                  <description>!A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_NOT_B</name>
                  <description>A AND (!B)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_B</name>
                  <description>!B</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XOR_B</name>
                  <description>A XOR B</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NAND_B</name>
                  <description>A NAND B</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_B</name>
                  <description>A AND B</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XNOR_B</name>
                  <description>A XNOR B</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>B</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_OR_B</name>
                  <description>(!A) OR B</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>A</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_NOT_B</name>
                  <description>A OR (!B)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_B</name>
                  <description>A OR B</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGICAL_ONE</name>
                  <description>Logical 1</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNC_CH1_CTRL</name>
          <description>No Description</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x000C0000</resetValue>
          <resetMask>0x000F7F07</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FNSEL</name>
              <description>Function Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGICAL_ZERO</name>
                  <description>Logical 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NOR_B</name>
                  <description>A NOR B</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_AND_B</name>
                  <description>(!A) AND B</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A</name>
                  <description>!A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_NOT_B</name>
                  <description>A AND (!B)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_B</name>
                  <description>!B</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XOR_B</name>
                  <description>A XOR B</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NAND_B</name>
                  <description>A NAND B</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_B</name>
                  <description>A AND B</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XNOR_B</name>
                  <description>A XNOR B</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>B</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_OR_B</name>
                  <description>(!A) OR B</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>A</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_NOT_B</name>
                  <description>A OR (!B)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_B</name>
                  <description>A OR B</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGICAL_ONE</name>
                  <description>Logical 1</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
