NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG21/EFR32MG21B010F768IM32.svd
        <register>
          <name>CTRL</name>
          <description>No Description</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000107EF</resetMask>
          <fields>
            <field>
              <name>FORCEDISABLE</name>
              <description>Force Radio Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSTXEN</name>
              <description>PRS TX Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXAFTERRX</name>
              <description>TX After RX</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>TX will not be started automatically.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>A transition to TX is automatically started when a received frame is accepted by the FRC.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSMODE</name>
              <description>PRS RXEN Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIRECT</name>
                  <description>The PRS signal is used directly</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE</name>
                  <description>The PRS signal is used as an RX enable pulse</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSCLR</name>
              <description>PRS RXEN Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXSEARCH</name>
                  <description>The PRS RXEN signal is cleared when the RSM state enters RXSEARCH</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH</name>
                  <description>The Selected PRS channel in PRSCLRSEL is used as a disable pulse</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPOSTPONE</name>
              <description>TX Postpone</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>In the TX state transmit data is output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>In the TX state an unmodulated carrier is output until this bit is cleared.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTIVEPOL</name>
              <description>ACTIVE signal polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>Active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>Active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAENPOL</name>
              <description>PAEN signal polarity</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>Active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>Active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNAENPOL</name>
              <description>LNAEN signal polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>Active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>Active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSRXDIS</name>
              <description>PRS RX Disable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>PRS will not disable RX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>The channel selected by PRSRXDISSEL will generate a disable RX pulse</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSFORCETX</name>
              <description>PRS Force RX</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>PRS will not force TX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>The channel selected by PRSFORCETXSEL will generate a force TX pulse</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCESTATE</name>
          <description>No Description</description>
          <addressOffset>0x018</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>FORCESTATE</name>
              <description>Force RAC state transition</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>No Description</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FF0007</resetMask>
          <fields>
            <field>
              <name>STATECHANGE</name>
              <description>Radio State Change</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMCMPEV</name>
              <description>STIMER Compare Event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSERROR</name>
              <description>Bus Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ</name>
              <description>Sequencer Interrupt Flags</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>No Description</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FF0007</resetMask>
          <fields>
            <field>
              <name>STATECHANGE</name>
              <description>Radio State Change Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STIMCMPEV</name>
              <description>STIMER Compare Event Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSERROR</name>
              <description>Bus Error Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ</name>
              <description>Sequencer Flags Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTCTRL</name>
          <description>No Description</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>MODEN</name>
              <description>Modulator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMODEN</name>
              <description>Demodulator enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX2RFSENSE</name>
              <description>Enable auxiliary synthesizer output</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>The auxiliary synthesizer is not connected to the RFSENSE input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>The auxiliary synthesizer is connected to the RFSENSE input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPBACK2LNAINPUT</name>
              <description>Enable RF loopback</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPBACK2LNAOUTPUT</name>
              <description>Enable RF loopback</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQSTATUS</name>
          <description>No Description</description>
          <addressOffset>0x028</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000010</resetValue>
          <resetMask>0x000005FF</resetMask>
          <fields>
            <field>
              <name>STOPPED</name>
              <description>Sequencer Stopped</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BKPT</name>
              <description>Breakpoint Enabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WAITING</name>
              <description>Sequencer Waiting</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WAITMODE</name>
              <description>Sequencer Waiting Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANY</name>
                  <description>Sequencer is waiting for any of the events indicated SEQ_WAITMASK.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>Sequencer is waiting for all the events indicated SEQ_WAITMASK.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DONE</name>
              <description>Sequencer Done Signal</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NEG</name>
              <description>Negative Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POS</name>
              <description>Positive Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZERO</name>
              <description>Zero Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CARRY</name>
              <description>Carry Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ABORTEN</name>
              <description>Sequencer Program Execution Abort Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>Sequencer Program Execution can not be aborted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>Sequencer Program Execution can be aborted.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQCMD</name>
          <description>No Description</description>
          <addressOffset>0x02C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>HALT</name>
              <description>Sequencer Halt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STEP</name>
              <description>Sequencer Step</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RESUME</name>
              <description>Sequencer Resume</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BKPTEN</name>
              <description>Breakpoint Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BKPTDIS</name>
              <description>Breakpoint Disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ABORT</name>
              <description>Sequencer Execution Abort</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ABORTENSET</name>
              <description>Set Sequencer Abort Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ABORTENCLEAR</name>
              <description>Clear Sequencer Abort Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BREAKPOINT</name>
          <description>No Description</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BKPADDR</name>
              <description>Sequencer Breakpoint Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R0</name>
          <description>No Description</description>
          <addressOffset>0x034</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R0</name>
              <description>Sequencer Register 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R1</name>
          <description>No Description</description>
          <addressOffset>0x038</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R1</name>
              <description>Sequencer Register 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R2</name>
          <description>No Description</description>
          <addressOffset>0x03C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R2</name>
              <description>Sequencer Register 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R3</name>
          <description>No Description</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R3</name>
              <description>Sequencer Register 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R4</name>
          <description>No Description</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R4</name>
              <description>Sequencer Register 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R5</name>
          <description>No Description</description>
          <addressOffset>0x048</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R5</name>
              <description>Sequencer Register 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
